[
  {
    "id": "seerah-beginning",
    "title": "The Early Dawn",
    "summary": "The first revelation in Hira, the embrace of Khadijah, and the reassurance from Waraqah.",
    "text": "In the stillness of Hira, as Muhammad (peace be upon him) sat in reflection, the first revelation descended: “Read in the name of your Lord.” Trembling, he ran to Khadijah, who wrapped him in a cloak, soothing his heart. She reminded him: “Allah will never forsake you. You uphold kinship, care for the weak, and honor the guest.” Together they went to Waraqah, who affirmed, “This is the same Angel that came to Moses.” The dawn of Prophethood had begun, and mercy started to flow for all creation."
  },
  {
    "id": "taif-mercy",
    "title": "Mercy at Ta'if",
    "summary": "Despite rejection and stones, he chose mercy over vengeance.",
    "text": "When the people of Ta'if rejected the Prophet (peace be upon him) and drove him out with stones, he found shade in an orchard, bleeding and tired. The Angel of the Mountains offered to crush the valley between two peaks. Instead, he raised his hands and said, “O Allah, guide my people, for they do not know.” In that moment, mercy triumphed over anger, and the path of patience became a beacon for all who are tested."
  },
  {
    "id": "night-journey",
    "title": "Al-Isra wal Mi'raj",
    "summary": "A journey from Makkah to Jerusalem and through the heavens, returning with the gift of prayer.",
    "text": "In one miraculous night, the Prophet (peace be upon him) was carried from the Kaaba to Al-Aqsa, leading the prophets in prayer. From there he ascended through the heavens, meeting Adam, Yusuf, Idris, Harun, Isa and Yahya, and finally Ibrahim. At the Lote Tree of the Utmost Boundary, he was given the gift of prayer—first fifty, then out of mercy reduced to five with the reward of fifty. He returned with light in his heart and a direct connection between the believer and the Lord."
  },
  {
    "id": "hijrah-cave",
    "title": "In the Cave of Thawr",
    "summary": "Surrounded by enemies, a spider’s web and a dove’s nest became a shield.",
    "text": "Hidden in the Cave of Thawr with Abu Bakr, the Prophet (peace be upon him) heard the footsteps of pursuers outside. Abu Bakr whispered in fear; the Prophet replied, “Do not grieve, indeed Allah is with us.” A spider’s web veiled the entrance and a dove nested nearby, deceiving the trackers. Trusting in Allah’s plan, they left at night toward Madinah, the city of light, carrying hope for a new community of faith."
  },
  {
    "id": "madinah-brotherhood",
    "title": "Hearts United in Madinah",
    "summary": "The Ansar embraced the Muhajirun, forming a brotherhood that healed hearts and lifted poverty.",
    "text": "In Madinah, the Prophet (peace be upon him) paired each emigrant (Muhajir) with a host (Ansari). The wealthy offered half their orchards, the poor shared their homes. Suhayb the Roman, Salman the Persian, and Bilal the Abyssinian all stood shoulder to shoulder, equal before Allah. The Adhan rose over the city, the masjid became the heart of life, and the brotherhood of faith replaced tribal rivalry. Mercy, justice, and generosity began to reshape society."
  }
]
