[
  {
    "id": "seerah-beginning",
    "title": "The Early Dawn",
    "summary": "The first revelation in Hira, the embrace of Khadijah, and the reassurance from Waraqah.",
    "text": "In the stillness of Hira, as Muhammad (peace be upon him) sat in reflection, the first revelation descended: “Read in the name of your Lord.” Trembling, he ran to Khadijah, who wrapped him in a cloak, soothing his heart. She reminded him: “Allah will never forsake you. You uphold kinship, care for the weak, and honor the guest.” Together they went to Waraqah, who affirmed, “This is the same Angel that came to Moses.” The dawn of Prophethood had begun, and mercy started to flow for all creation.",
    "titleArabic": "الفجر المبكر",
    "summaryArabic": "أول الوحي في حراء واحتضان خديجة والطمأنينة من ورقة.",
    "textArabic": "وفي سكون حراء، بينما كان محمد (صلى الله عليه وسلم) جالساً يتفكر، نزل الوحي الأول: «اقرأ باسم ربك». فركض وهو يرتجف إلى خديجة التي لففته بعباءة تطمئن قلبه. فذكّرته: «لن يضيعك الله أبدًا، تصل الرحم، وتصل الضعيف، وتكرم الضيف». وذهبا معًا إلى ورقة، فقال: \"هذا هو نفس الملك الذي جاء إلى موسى\". وقد طلع فجر النبوة، وتدفقت الرحمة على الخلق أجمعين."
  },
  {
    "id": "taif-mercy",
    "title": "Mercy at Ta'if",
    "summary": "Despite rejection and stones, he chose mercy over vengeance.",
    "text": "When the people of Ta'if rejected the Prophet (peace be upon him) and drove him out with stones, he found shade in an orchard, bleeding and tired. The Angel of the Mountains offered to crush the valley between two peaks. Instead, he raised his hands and said, “O Allah, guide my people, for they do not know.” In that moment, mercy triumphed over anger, and the path of patience became a beacon for all who are tested.",
    "titleArabic": "الرحمة بالطائف",
    "summaryArabic": "ورغم الرفض والحجارة، اختار الرحمة على الانتقام.",
    "textArabic": "ولما كذب أهل الطائف النبي صلى الله عليه وسلم وأخرجوه بالحجارة وجد ظلا في بستان ينزف دما وتعبا. عرض ملاك الجبال أن يسحق الوادي الواقع بين قمتين. فرفع يديه وقال: «اللهم اهد قومي فإنهم لا يعلمون». في تلك اللحظة انتصرت الرحمة على الغضب، وأصبح طريق الصبر منارة لكل المبتلين."
  },
  {
    "id": "night-journey",
    "title": "Al-Isra wal Mi'raj",
    "summary": "A journey from Makkah to Jerusalem and through the heavens, returning with the gift of prayer.",
    "text": "In one miraculous night, the Prophet (peace be upon him) was carried from the Kaaba to Al-Aqsa, leading the prophets in prayer. From there he ascended through the heavens, meeting Adam, Yusuf, Idris, Harun, Isa and Yahya, and finally Ibrahim. At the Lote Tree of the Utmost Boundary, he was given the gift of prayer—first fifty, then out of mercy reduced to five with the reward of fifty. He returned with light in his heart and a direct connection between the believer and the Lord.",
    "titleArabic": "الإسراء والمعراج",
    "summaryArabic": "رحلة من مكة إلى القدس وعبر السماء، عودة بهدية الصلاة.",
    "textArabic": "وفي إحدى الليالي المعجزة، حُمل النبي صلى الله عليه وسلم من الكعبة إلى الأقصى، ليصلي بالأنبياء. ومن هناك صعد إلى السماء فقابل آدم ويوسف وإدريس وهارون وعيسى ويحيى وأخيراً إبراهيم. عند سدرة الحد الأقصى، أُعطي هدية الصلاة - الخمسين الأولى، ثم من باب الرحمة تم تخفيضها إلى خمس بأجر الخمسين. لقد عاد بنور في قلبه، واتصال مباشر بين المؤمن والرب."
  },
  {
    "id": "hijrah-cave",
    "title": "In the Cave of Thawr",
    "summary": "Surrounded by enemies, a spider’s web and a dove’s nest became a shield.",
    "text": "Hidden in the Cave of Thawr with Abu Bakr, the Prophet (peace be upon him) heard the footsteps of pursuers outside. Abu Bakr whispered in fear; the Prophet replied, “Do not grieve, indeed Allah is with us.” A spider’s web veiled the entrance and a dove nested nearby, deceiving the trackers. Trusting in Allah’s plan, they left at night toward Madinah, the city of light, carrying hope for a new community of faith.",
    "titleArabic": "في غار ثور",
    "summaryArabic": "محاطًا بالأعداء، أصبحت شبكة العنكبوت وعش الحمام درعًا.",
    "textArabic": "وكان النبي صلى الله عليه وسلم مختبئا في غار ثور مع أبي بكر، فسمع وقع أقدام المطاردين في الخارج. همس أبو بكر في خوف؛ فقال النبي: \"لا تحزن إن الله معنا\". غطت شبكة عنكبوت المدخل وعششت حمامة في مكان قريب مما خدع المتتبعين. واثقين بتدبير الله، غادروا ليلاً نحو المدينة المنورة، مدينة النور، حاملين الأمل في مجتمع مؤمن جديد."
  },
  {
    "id": "madinah-brotherhood",
    "title": "Hearts United in Madinah",
    "summary": "The Ansar embraced the Muhajirun, forming a brotherhood that healed hearts and lifted poverty.",
    "text": "In Madinah, the Prophet (peace be upon him) paired each emigrant (Muhajir) with a host (Ansari). The wealthy offered half their orchards, the poor shared their homes. Suhayb the Roman, Salman the Persian, and Bilal the Abyssinian all stood shoulder to shoulder, equal before Allah. The Adhan rose over the city, the masjid became the heart of life, and the brotherhood of faith replaced tribal rivalry. Mercy, justice, and generosity began to reshape society.",
    "titleArabic": "قلوب متحدة بالمدينة المنورة",
    "summaryArabic": "واحتضن الأنصار المهاجرين، فشكلوا أخوة تشفي القلوب وترفع الفقر.",
    "textArabic": "وفي المدينة المنورة، جمع النبي صلى الله عليه وسلم كل مهاجر مع مضيف (الأنصاري). عرض الأغنياء نصف بساتينهم، وتقاسم الفقراء منازلهم. صهيب الرومي، وسلمان الفارسي، وبلال الحبشي، وقفوا جنبًا إلى جنب أمام الله سواءً. وارتفع الأذان في سماء المدينة، وأصبح المسجد قلب الحياة، وحلت الأخوة الدينية محل التنافس القبلي. بدأت الرحمة والعدالة والكرم في إعادة تشكيل المجتمع."
  }
]
